Revit 2027 API
ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled Property
 "Segment Bends"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace